```
[0m[1mInitializing modules...[0m

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/vsphere from the dependency lock file
- Using previously-installed hashicorp/vsphere v1.24.2

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[32m[1mSuccess![0m The configuration is valid.
[0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.example-server-basic["linuxvm"].vsphere_virtual_machine.Linux[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "vsphere_virtual_machine" "Linux" {
      [32m+[0m [0m[1m[0mboot_retry_delay[0m[0m                        = 10000
      [32m+[0m [0m[1m[0mchange_version[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mcpu_limit[0m[0m                               = -1
      [32m+[0m [0m[1m[0mcpu_share_count[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mcpu_share_level[0m[0m                         = "normal"
      [32m+[0m [0m[1m[0mdatastore_id[0m[0m                            = "datastore-7086"
      [32m+[0m [0m[1m[0mdefault_ip_address[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mefi_secure_boot_enabled[0m[0m                 = false
      [32m+[0m [0m[1m[0mept_rvi_mode[0m[0m                            = "automatic"
      [32m+[0m [0m[1m[0mfirmware[0m[0m                                = "bios"
      [32m+[0m [0m[1m[0mfolder[0m[0m                                  = "ses"
      [32m+[0m [0m[1m[0mforce_power_off[0m[0m                         = true
      [32m+[0m [0m[1m[0mguest_id[0m[0m                                = "ubuntu64Guest"
      [32m+[0m [0m[1m[0mguest_ip_addresses[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mhardware_version[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mhost_system_id[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mhv_mode[0m[0m                                 = "hvAuto"
      [32m+[0m [0m[1m[0mid[0m[0m                                      = (known after apply)
      [32m+[0m [0m[1m[0mide_controller_count[0m[0m                    = 2
      [32m+[0m [0m[1m[0mignored_guest_ips[0m[0m                       = []
      [32m+[0m [0m[1m[0mimported[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mlatency_sensitivity[0m[0m                     = "normal"
      [32m+[0m [0m[1m[0mmemory[0m[0m                                  = 4096
      [32m+[0m [0m[1m[0mmemory_limit[0m[0m                            = -1
      [32m+[0m [0m[1m[0mmemory_share_count[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mmemory_share_level[0m[0m                      = "normal"
      [32m+[0m [0m[1m[0mmigrate_wait_timeout[0m[0m                    = 30
      [32m+[0m [0m[1m[0mmoid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                    = "ses-terraform-test1"
      [32m+[0m [0m[1m[0mnum_cores_per_socket[0m[0m                    = 1
      [32m+[0m [0m[1m[0mnum_cpus[0m[0m                                = 2
      [32m+[0m [0m[1m[0mpoweron_timeout[0m[0m                         = 300
      [32m+[0m [0m[1m[0mreboot_required[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mresource_pool_id[0m[0m                        = "resgroup-7075"
      [32m+[0m [0m[1m[0mrun_tools_scripts_after_power_on[0m[0m        = true
      [32m+[0m [0m[1m[0mrun_tools_scripts_after_resume[0m[0m          = true
      [32m+[0m [0m[1m[0mrun_tools_scripts_before_guest_shutdown[0m[0m = true
      [32m+[0m [0m[1m[0mrun_tools_scripts_before_guest_standby[0m[0m  = true
      [32m+[0m [0m[1m[0msata_controller_count[0m[0m                   = 0
      [32m+[0m [0m[1m[0mscsi_bus_sharing[0m[0m                        = "noSharing"
      [32m+[0m [0m[1m[0mscsi_controller_count[0m[0m                   = 1
      [32m+[0m [0m[1m[0mscsi_type[0m[0m                               = "pvscsi"
      [32m+[0m [0m[1m[0mshutdown_wait_timeout[0m[0m                   = 3
      [32m+[0m [0m[1m[0mstorage_policy_id[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mswap_placement_policy[0m[0m                   = "inherit"
      [32m+[0m [0m[1m[0muuid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0mvapp_transport[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mvmware_tools_status[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mvmx_path[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mwait_for_guest_ip_timeout[0m[0m               = 0
      [32m+[0m [0m[1m[0mwait_for_guest_net_routable[0m[0m             = true
      [32m+[0m [0m[1m[0mwait_for_guest_net_timeout[0m[0m              = 5

      [32m+[0m [0mclone {
          [32m+[0m [0m[1m[0mlinked_clone[0m[0m  = false
          [32m+[0m [0m[1m[0mtemplate_uuid[0m[0m = "421db8db-3e1d-b66d-beaf-47ac8b74a7a6"
          [32m+[0m [0m[1m[0mtimeout[0m[0m       = 30

          [32m+[0m [0mcustomize {
              [32m+[0m [0m[1m[0mtimeout[0m[0m = 10

              [32m+[0m [0mlinux_options {
                  [32m+[0m [0m[1m[0mdomain[0m[0m       = "Development.com"
                  [32m+[0m [0m[1m[0mhost_name[0m[0m    = "ses-terraform-test1"
                  [32m+[0m [0m[1m[0mhw_clock_utc[0m[0m = true
                }

              [32m+[0m [0mnetwork_interface {
                  [32m+[0m [0m[1m[0mipv4_netmask[0m[0m = 24
                }
            }
        }

      [32m+[0m [0mdisk {
          [32m+[0m [0m[1m[0mattach[0m[0m            = false
          [32m+[0m [0m[1m[0mcontroller_type[0m[0m   = "scsi"
          [32m+[0m [0m[1m[0mdatastore_id[0m[0m      = "<computed>"
          [32m+[0m [0m[1m[0mdevice_address[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mdisk_mode[0m[0m         = "persistent"
          [32m+[0m [0m[1m[0mdisk_sharing[0m[0m      = "sharingNone"
          [32m+[0m [0m[1m[0meagerly_scrub[0m[0m     = false
          [32m+[0m [0m[1m[0mio_limit[0m[0m          = -1
          [32m+[0m [0m[1m[0mio_reservation[0m[0m    = 0
          [32m+[0m [0m[1m[0mio_share_count[0m[0m    = 0
          [32m+[0m [0m[1m[0mio_share_level[0m[0m    = "normal"
          [32m+[0m [0m[1m[0mkeep_on_remove[0m[0m    = false
          [32m+[0m [0m[1m[0mkey[0m[0m               = 0
          [32m+[0m [0m[1m[0mlabel[0m[0m             = "disk0"
          [32m+[0m [0m[1m[0mpath[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0msize[0m[0m              = 19
          [32m+[0m [0m[1m[0mstorage_policy_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mthin_provisioned[0m[0m  = true
          [32m+[0m [0m[1m[0munit_number[0m[0m       = 0
          [32m+[0m [0m[1m[0muuid[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mwrite_through[0m[0m     = false
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0madapter_type[0m[0m          = "vmxnet3"
          [32m+[0m [0m[1m[0mbandwidth_limit[0m[0m       = -1
          [32m+[0m [0m[1m[0mbandwidth_reservation[0m[0m = 0
          [32m+[0m [0m[1m[0mbandwidth_share_count[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mbandwidth_share_level[0m[0m = "normal"
          [32m+[0m [0m[1m[0mdevice_address[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mkey[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mmac_address[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_id[0m[0m            = "dvportgroup-7081"
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
 
```